Update RFC5 with the latest view on `processes/` KV
