--- a/rfc/5/README.md
+++ b/rfc/5/README.md
@@ -167,49 +167,33 @@ Hax processes the following callbacks from `ha_link` (via `m0_ha_halon_interface
 
 The general idea of storing the mero process status in Consul KV can be seen below.
 
-```
-     ┌────┐                             ┌───┐                                 ┌──┐                    ┌──────────┐          ┌──────┐
-     │Mero│                             │Hax│                                 │KV│                    │X check.sh│          │Consul│
-     └─┬──┘                             └─┬─┘                                 └┬─┘                    └────┬─────┘          └──┬───┘
-       │ Process P is now online at node N│                                    │                           │                   │
-       │ ─────────────────────────────────>                                    │                           │                   │
-       │                                  │                                    │                           │                   │
-       │                                  │ put m0d-service-status/N/P = online│                           │                   │
-       │                                  │ ───────────────────────────────────>                           │                   │
-       │                                  │                                    │                           │                   │
-       │                                  │                 Ok                 │                           │                   │
-       │                                  │ <─ ─ ─ ─ ─ ─ ─ ─ ─ ─ ─ ─ ─ ─ ─ ─ ─ ─                           │                   │
-       │                                  │                                    │                           │                   │
-       │                                  │                                    │                           │                   │
-       │                                  │                         ╔═══════╤══╪═══════════════════════════╪═══════════════════╪═════════════╗
-       │                                  │                         ║ LOOP  │  every n sec                 │                   │             ║
-       │                                  │                         ╟───────┘  │                           │                   │             ║
-       │                                  │                         ║          │                           │    Is P alive?    │             ║
-       │                                  │                         ║          │                           │ <──────────────────             ║
-       │                                  │                         ║          │                           │                   │             ║
-       │                                  │                         ║          │ get m0d-service-status/N/P│                   │             ║
-       │                                  │                         ║          │ <──────────────────────────                   │             ║
-       │                                  │                         ║          │                           │                   │             ║
-       │                                  │                         ║          │           online          │                   │             ║
-       │                                  │                         ║          │  ─ ─ ─ ─ ─ ─ ─ ─ ─ ─ ─ ─ ─>                   │             ║
-       │                                  │                         ║          │                           │                   │             ║
-       │                                  │                         ║          │                           │────┐              │             ║
-       │                                  │                         ║          │                           │    │ pgrep for P  │             ║
-       │                                  │                         ║          │                           │<───┘              │             ║
-       │                                  │                         ║          │                           │                   │             ║
-       │                                  │                         ║          │                           │        Yes        │             ║
-       │                                  │                         ║          │                           │  ─ ─ ─ ─ ─ ─ ─ ─ ─>             ║
-       │                                  │                         ╚══════════╪═══════════════════════════╪═══════════════════╪═════════════╝
-     ┌─┴──┐                             ┌─┴─┐                                 ┌┴─┐                    ┌────┴─────┐          ┌──┴───┐
-     │Mero│                             │Hax│                                 │KV│                    │X check.sh│          │Consul│
-     └────┘                             └───┘                                 └──┘                    └──────────┘          └──────┘
+```plantuml
+@startuml
+participant Mero
+participant Hax
+participant KV
+participant "P health-check.sh" as Checker
 
+Mero -> Hax: Process P is now online
+Hax -> KV: put processes/<FID> = online
+KV --> Hax: Ok
+loop every n sec
+  Consul -> Checker: Is P alive?
+  Checker -> KV: get processes/<FID>
+  KV --> Checker: online
+  Checker -> Checker: pgrep for P
+  Checker --> Consul: Yes
+  Consul -> Consul: Mark P as green
+end
+
+@enduml
 ```
 
 **Notes:**
 
